import { defineStore } from 'pinia'
import { ref } from 'vue'

export const useReportContentStore = defineStore('reportContent', () => {
  const scheduleReport = ref(`

  # 20250110调度报告
  
  计划开始：2024/7/8_00：00：00.000
  计划结束：2024/7/14_00：00：00.000
  计划持续时间：6_day(s)_00：00：00.000
  规划算法：OnePass
  
  ## 规划报告配置信息
  
  - 规划包名称：规划包20240708
  - 规划包路径：D:\\Projects\\STK11\\SchedulerWork\\sche
  - 规划开始时间：2024/7/8_00:00:00.000
  - 规划结束事件：2024/7/14_00:00:00.000
  - 任务优先级范围：1 - 10
  - 资源优先级范围：1 - 10
  - 时间颗粒度：1
  
  `)

  const resourceReport = ref(`
  
  # 20250110资源报告
  
  计划开始：2024/7/8_00：00：00.000  
  计划结束：2024/7/14_00：00：00.000  
  计划持续时间：6_day(s)_00：00：00.000  
  规划算法：OnePass
  
  ## 资源分配情况
  
  - 资源名称：厦门站-问天
  - 资源描述：测控弧段
  - 资源优先级：5
  - 所属资源组：厦门站测控弧段资源组
  - 容量：3
  - 支持任务数：5
  
  ### 支持任务列表
  
  | 任务ID | 开始时间 | 结束时间 |
  |--------|----------|----------|
  | FK101 | 2024/7/9_00:00:00.000 | 2024/7/9_01:20:00.000 |
  | FK103 | 2024/7/10_00:00:00.000 | 2024/7/10_01:20:00.000 |
  | FK105 | 2024/7/11_00:00:00.000 | 2024/7/11_01:20:00.000 |
  | FK107 | 2024/7/12_00:00:00.000 | 2024/7/12_01:20:00.000 |
  | FK108 | 2024/7/13_00:00:00.000 | 2024/7/14_01:20:00.000 |
  
  `)

  const summaryReport = ref(`
  
  # 20250110摘要报告
  
  计划开始：2024/7/8_00：00：00.000  
  计划结束：2024/7/14_00：00：00.000  
  计划持续时间：6_day(s)_00：00：00.000  
  规划算法：OnePass
  
  ## 规划概况
  
  - 资源总数：4
  - 模板任务：32 (0)
  - 重复性任务：32 (3)
  - 任务总数：32
  - 推迟的任务：0
  - 锁定任务：0
  - 分配任务总数：30
  - 任务总时长（秒）：106412.839
  
  ### 调度统计
  
  | 类型 | 数量 | 百分比 |
  |------|------|--------|
  | 已分配任务 | 30 | 93.75% |
  
  `)

  const taskGroupReport = ref(`
  
  # 20250110任务组报告
  
  计划开始：2024/7/8_00：00：00.000  
  计划结束：2024/7/14_00：00：00.000  
  计划持续时间：6_day(s)_00：00：00.000  
  规划算法：OnePass
  
  ## 任务组安排情况
  
  - 任务组描述：重复性任务
  - 组内任务关系：无
  - 任务组包含任务：FK101、FK101 (2)、FK101 (3)、FK101 (4)、FK101 (5)
  
  
  ### 任务分配情况
  
  | 任务ID | 开始时间 | 结束时间 | 资源 |
  |--------|----------|----------|------|
  | FK101 | 2024/7/8_00:00:00.000 | 2024/7/8_01:20:00.000 | 厦门站-问天_44076 |
  | FK101 (1) | 2024/7/9_00:00:00.000 | 2024/7/9_01:20:00.000 | 厦门站-问天_44076 |
  | FK101 (2) | 2024/7/10_00:00:00.000 | 2024/7/10_01:20:00.000 | 厦门站-问天_44076 |
  | FK101 (3) | 2024/7/11_00:00:00.000 | 2024/7/11_01:20:00.000 | 厦门站-问天_44076 |
  | FK101 (4) | 2024/7/12_00:00:00.000 | 2024/7/12_01:20:00.000 | 厦门站-问天_44076 |
  | FK101 (5) | 2024/7/13_00:00:00.000 | 2024/7/14_01:20:00.000 | 厦门站-问天_44076 |
  
  `)

  const taskConflictReport = ref(`
  
  # 20250110任务冲突报告
  
  计划开始：2024/7/8_00：00：00.000  
  计划结束：2024/7/14_00：00：00.000  
  计划持续时间：6_day(s)_00：00：00.000  
  规划算法：OnePass
  
  ## 任务冲突详情
  
  无冲突
  
  `)

  const taskReport = ref(`
  
  # 20250110任务报告
  
  计划开始：2024/7/8_00：00：00.000  
  计划结束：2024/7/14_00：00：00.000  
  计划持续时间：6_day(s)_00：00：00.000  
  规划算法：OnePass
  
  ## 任务分配情况
  
  - 任务描述：数据注入事件
  - 任务优先级：5
  - 所属任务组：数据注入任务组
  - 使用资源：厦门站-问天 2024/7/9_00:00:00.000 2024/7/9_01:20:00.000
  
  ### 重复任务分配情况
  
  | 任务ID | 开始时间 | 结束时间 | 资源 |
  |--------|----------|----------|------|
  | FK101 (1) | 2024/7/9_00:00:00.000 | 2024/7/9_01:20:00.000 | 厦门站-问天_44076 |
  | FK101 (2) | 2024/7/10_00:00:00.000 | 2024/7/10_01:20:00.000 | 厦门站-问天_44076 |
  | FK101 (3) | 2024/7/11_00:00:00.000 | 2024/7/11_01:20:00.000 | 厦门站-问天_44076 |
  | FK101 (4) | 2024/7/12_00:00:00.000 | 2024/7/12_01:20:00.000 | 厦门站-问天_44076 |
  | FK101 (5) | 2024/7/13_00:00:00.000 | 2024/7/14_01:20:00.000 | 厦门站-问天_44076 |
  
  `)

  return {
    scheduleReport,
    resourceReport,
    summaryReport,
    taskGroupReport,
    taskConflictReport,
    taskReport
  }
})
